Revit 2026 API

# ApplicationCurrentUsersDataFolderPath Property

---

Path to data folder for the current user.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CurrentUsersDataFolderPath { get; }
```
```vb
Public ReadOnly Property CurrentUsersDataFolderPath As String
	Get
```
```cpp
public:
property String^ CurrentUsersDataFolderPath {
	String^ get ();
}
```
```fsharp
member CurrentUsersDataFolderPath : string with get
```

#### Property Value

String

Similar to C:\Users\\[UserName]\AppData\Roaming\Autodesk\\[ProductType]\\[ReleaseName]

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace